//----------------------------------------------------------------------------------------------------------------------
///
/// \file       kalman_filter_debug.cpp
/// \brief      Отладочный ключ для фильтров Калмана
/// \date       23.05.22 - создан
/// \author     Соболев А.А.
/// \addtogroup kalman_filters
/// \{
///

#include <kalman_filter_debug.h>

namespace KalmanFilters /// Фильтры Калмана
{

//----------------------------------------------------------------------------------------------------------------------
std::string GetVersion()
{
    return "KalmanFilters_23.05.2022_v01_Develop";
}

}
/// \}
