//----------------------------------------------------------------------------------------------------------------------
///
/// \file       units.h
/// \brief      Единицы измерения физических величин, форматы чисел
/// \date       17.02.20 - создан
/// \author     Соболев А.А.
/// \addtogroup spml
/// \{
///

#ifndef SPML_UNITS_H
#define SPML_UNITS_H

namespace SPML /// Специальная библиотека программных модулей (СБПМ)
{
namespace Units /// Единицы измерения физических величин, форматы чисел
{
//----------------------------------------------------------------------------------------------------------------------
///
/// \brief Формат числа
///
enum TNumberFormat : int
{
    NF_Fixed = 0, ///< Отображение фиксированного числа знаков после запятой
    NF_Scientific = 1 ///< Отображение в научном формате 1e+000
};

//----------------------------------------------------------------------------------------------------------------------
///
/// \brief Размерность угловых единиц
///
enum TAngleUnit : int
{
    AU_Radian = 0, ///< Радиан
    AU_Degree = 1 ///< Градус
};

//----------------------------------------------------------------------------------------------------------------------
///
/// \brief Размерность единиц дальности
///
enum TRangeUnit : int
{
    RU_Meter = 0, ///< Метр
    RU_Kilometer = 1 ///< Километр
};

}
}
#endif // SPML_UNITS_H
/// \}
